app/views/posts/index.html.erb

<% Post.all.each.with_index(1) do |post, i| %>
---
SELECT "posts".* FROM "posts"