app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2016-10-10 19:59:42.789561"], ["updated_at", "2016-10-10 19:59:42.789561"]]
---
  def create
    Post.create(title: params[:title], description: params[:description])